; domain
;; source: ...
;; updates:
;;   - :negative-preconditions added
;;   - turn_to action has a new precondition (not (pointing ?s ?d_new))

(define (domain satellite)
    (:requirements :strips :typing :negative-preconditions)
    (:types
        satellite direction instrument mode
    )
    (:predicates
        (on_board ?i - instrument ?s - satellite)
        (supports ?i - instrument ?m - mode)
        (pointing ?s - satellite ?d - direction)
        (power_avail ?s - satellite)
        (power_on ?i - instrument)
        (calibrated ?i - instrument)
        (have_image ?d - direction ?m - mode)
        (calibration_target ?i - instrument ?d - direction)
    )

    (:action turn_to
        :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
        :precondition (and
            (pointing ?s ?d_prev)
            (not (pointing ?s ?d_new)))
        :effect (and
            (pointing ?s ?d_new)
            (not (pointing ?s ?d_prev)))
    )

    (:action switch_on
        :parameters (?i - instrument ?s - satellite)
        :precondition (and
            (on_board ?i ?s)
            (power_avail ?s))
        :effect (and
            (power_on ?i)
            (not (calibrated ?i))
            (not (power_avail ?s)))
    )

    (:action switch_off
        :parameters (?i - instrument ?s - satellite)
        :precondition (and (on_board ?i ?s)
            (power_on ?i))
        :effect (and (not (power_on ?i))
            (power_avail ?s))
    )

    (:action calibrate
        :parameters (?s - satellite ?i - instrument ?d - direction)
        :precondition (and (on_board ?i ?s)
            (calibration_target ?i ?d)
            (pointing ?s ?d)
            (power_on ?i))
        :effect (calibrated ?i)
    )

    (:action take_image
        :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
        :precondition (and (calibrated ?i)
            (on_board ?i ?s)
            (supports ?i ?m)
            (power_on ?i)
            (pointing ?s ?d))
        :effect (have_image ?d ?m)
    )
)

; problem
(define (problem satellite-07)
 (:domain satellite)
 (:objects
    sat1 sat2 - satellite
    ins1 ins2 - instrument
    mod1 mod2 - mode
    dir1 dir2 dir3 - direction
    )
 (:init
    (pointing sat1 dir3)
    (pointing sat2 dir1)
    (power_avail sat1)
    (power_avail sat2)
    (calibration_target ins1 dir1)
    (calibration_target ins2 dir2)
    (on_board ins1 sat1)
    (on_board ins2 sat2)
    (supports ins2 mod1)
    (supports ins1 mod2))
 (:goal  (and
    (have_image dir1 mod1)
    (have_image dir2 mod2)
    (have_image dir3 mod1)
    (have_image dir3 mod2))))

; plan
1. (switch_on ins2 sat2)
   deleted: (power_avail sat2)
   added: (power_on ins2)
   goals met: 0 of 4
2. (turn_to sat2 dir2 dir1)
   deleted: (pointing sat2 dir1)
   added: (pointing sat2 dir2)
   goals met: 0 of 4
3. (calibrate sat2 ins2 dir2)
   added: (calibrated ins2)
   goals met: 0 of 4
4. (turn_to sat2 dir1 dir2)
   deleted: (pointing sat2 dir2)
   added: (pointing sat2 dir1)
   goals met: 0 of 4
5. (take_image sat2 dir1 ins2 mod1)
   added: (have_image dir1 mod1)
   goals met: 1 of 4
6. (turn_to sat2 dir3 dir1)
   deleted: (pointing sat2 dir1)
   added: (pointing sat2 dir3)
   goals met: 1 of 4
7. (take_image sat2 dir3 ins2 mod1)
   added: (have_image dir3 mod1)
   goals met: 2 of 4
8. (switch_on ins1 sat1)
   deleted: (power_avail sat1)
   added: (power_on ins1)
   goals met: 2 of 4
9. (turn_to sat1 dir1 dir3)
   deleted: (pointing sat1 dir3)
   added: (pointing sat1 dir1)
   goals met: 2 of 4
10. (calibrate sat1 ins1 dir1)
   added: (calibrated ins1)
   goals met: 2 of 4
11. (turn_to sat1 dir2 dir1)
   deleted: (pointing sat1 dir1)
   added: (pointing sat1 dir2)
   goals met: 2 of 4
12. (take_image sat1 dir2 ins1 mod2)
   added: (have_image dir2 mod2)
   goals met: 3 of 4
13. (turn_to sat1 dir3 dir2)
   deleted: (pointing sat1 dir2)
   added: (pointing sat1 dir3)
   goals met: 3 of 4
14. (take_image sat1 dir3 ins1 mod2)
   added: (have_image dir3 mod2)
   goals met: 4 of 4
